In [2]:
#import relevant libraries
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.pylab as plb
import os
import warnings
import json

warnings.filterwarnings('ignore')

In [3]:
#load all related dataset
df_prod= pd.read_csv('C:/Users/DONKAMS/Downloads/Stage-D-Exercise/Dataset (Prep)/Africa Food Production (2004 - 2013).csv')
df_supp= pd.read_csv('C:/Users/DONKAMS/Downloads/Stage-D-Exercise/Dataset (Prep)/Africa Food Supply (2004 - 2013).csv')

In [4]:
df_prod.head()

   Country                Item  Year  Value
0  Algeria  Wheat and products  2004   2731
1  Algeria  Wheat and products  2005   2415
2  Algeria  Wheat and products  2006   2688
3  Algeria  Wheat and products  2007   2319
4  Algeria  Wheat and products  2008   1111

In [5]:
df_prod.shape

(23110, 4)

In [6]:
df_prod.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23110 entries, 0 to 23109
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  23110 non-null  object
 1   Item     23110 non-null  object
 2   Year     23110 non-null  int64
 3   Value    23110 non-null  int64
dtypes: int64(2), object(2)
memory usage: 722.3+ KB

In [7]:
df_prod.describe()

               Year         Value
count  23110.000000  23110.000000
mean    2008.498269    327.785201
std        2.871740   1607.940343
min     2004.000000      0.000000
25%     2006.000000      3.000000
50%     2008.000000     18.000000
75%     2011.000000    108.000000
max     2013.000000  54000.000000

In [8]:
df_supp.head()

   Country  Year  Value
0  Algeria  2004   2987
1  Algeria  2005   2958
2  Algeria  2006   3047
3  Algeria  2007   3041
4  Algeria  2008   3048

In [9]:
df_supp.shape

(450, 3)

In [10]:
df_supp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 450 entries, 0 to 449
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  450 non-null    object
 1   Year     450 non-null    int64
 2   Value    450 non-null    int64
dtypes: int64(2), object(1)
memory usage: 10.7+ KB

In [11]:
df_supp.describe()

              Year        Value
count   450.000000   450.000000
mean   2008.500000  2469.775556
std       2.875478   379.140143
min    2004.000000  1781.000000
25%    2006.000000  2174.000000
50%    2008.500000  2376.000000
75%    2011.000000  2681.750000
max    2013.000000  3561.000000

In [13]:
df_prod.columns , df_supp.columns

(Index(['Country', 'Item', 'Year', 'Value'], dtype='object'),
 Index(['Country', 'Year', 'Value'], dtype='object'))